tutorials/hybridCentralFoam/incompressible/circularChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

vertices
(
    (    0 0.00000  0.0000000)
    (161.0 0.00000  0.0000000)
    (161.0 2.29965  0.0401405)
    (  0.0 2.29965  0.0401405)
    
    (161.0 2.29965 -0.0401405)
    (  0.0 2.29965 -0.0401405)
);

blocks
(
    hex (0 1 4 5 0 1 2 3) (1610 23 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wedge1
    {
        type wedge;
        faces
        (
            (0 1 2 3)
        );
    }

    wedge2
    {
        type wedge;
        faces
        (
            (0 1 4 5)
        );
    }

    inlet
    {
	type patch;
	faces
	(
	    (5 0 0 3)
	);
    }
    outlet
    {
	type patch;
	faces
	(
	    (4 1 1 2)
	);
    }
    walls
    {
        type wall;
        faces
        (
            (3 2 4 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
